RIOT-OS/RIOT/cpu/cc2538/include/vendor/hw_flash_ctrl.h
#define FLASH_CTRL_FWDATA_FWDATA_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FLASH_CTRL_DIECFG0 register.
//
//*****************************************************************************
#define FLASH_CTRL_DIECFG0_CHIPID_M \
                                0xFFFF0000  // Register copy of configuration 
                                            // bits Three clock cycles after 
                                            // reset is released, this bit 
                                            // field is equal to the field with 
                                            // the same name in the information 
                                            // page. 

#define FLASH_CTRL_DIECFG0_CHIPID_S 16
#define FLASH_CTRL_DIECFG0_CLK_SEL_GATE_EN_N \
                                0x00000400  // Register copy of configuration 
                                            // bits Three clock cycles after 
                                            // reset is released, this bit is 
                                            // equal to the field with the same 
                                            // name in the information page. 

#define FLASH_CTRL_DIECFG0_CLK_SEL_GATE_EN_N_M \
                                0x00000400
#define FLASH_CTRL_DIECFG0_CLK_SEL_GATE_EN_N_S 10
#define FLASH_CTRL_DIECFG0_SRAM_SIZE_M \
                                0x00000380  // Register copy of configuration 
                                            // bits Three clock cycles after 
                                            // reset is released, this bit 
                                            // field is equal to the field with 
                                            // the same name in the information 
                                            // page. 

#define FLASH_CTRL_DIECFG0_SRAM_SIZE_S 7
#define FLASH_CTRL_DIECFG0_FLASH_SIZE_M \
                                0x00000070  // Register copy of configuration 
                                            // bits Three clock cycles after 
                                            // reset is released, this bit 
                                            // field is equal to the field with 
                                            // the same name in the information 
                                            // page. 

#define FLASH_CTRL_DIECFG0_FLASH_SIZE_S 4
#define FLASH_CTRL_DIECFG0_USB_ENABLE \
                                0x00000008  // Register copy of configuration 
                                            // bits Three clock cycles after 
                                            // reset is released, this bit is 
                                            // equal to the field with the same 
                                            // name in the information page. 

#define FLASH_CTRL_DIECFG0_USB_ENABLE_M \
                                0x00000008
#define FLASH_CTRL_DIECFG0_USB_ENABLE_S 3
#define FLASH_CTRL_DIECFG0_MASS_ERASE_ENABLE \
                                0x00000004  // Register copy of configuration 
                                            // bits Three clock cycles after 
                                            // reset is released, this bit is 
                                            // equal to the field with the same 
                                            // name in the information page. 

#define FLASH_CTRL_DIECFG0_MASS_ERASE_ENABLE_M \
                                0x00000004
#define FLASH_CTRL_DIECFG0_MASS_ERASE_ENABLE_S 2
#define FLASH_CTRL_DIECFG0_LOCK_FWT_N \
                                0x00000002  // Register copy of configuration 
                                            // bits Three clock cycles after 
                                            // reset is released, this bit is 
                                            // equal to the field with the same 
                                            // name in the information page. 

#define FLASH_CTRL_DIECFG0_LOCK_FWT_N_M \
                                0x00000002
#define FLASH_CTRL_DIECFG0_LOCK_FWT_N_S 1
#define FLASH_CTRL_DIECFG0_LOCK_IP_N \
                                0x00000001  // Register copy of configuration 
                                            // bits Three clock cycles after 
                                            // reset is released, this bit is 
                                            // equal to the field with the same 
                                            // name in the information page. 

#define FLASH_CTRL_DIECFG0_LOCK_IP_N_M \
                                0x00000001
#define FLASH_CTRL_DIECFG0_LOCK_IP_N_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FLASH_CTRL_DIECFG1 register.
//
//*****************************************************************************
#define FLASH_CTRL_DIECFG1_I2C_EN \
                                0x01000000  // 1: I2C is enabled. 0: I2C is 
                                            // permanently disabled. 

#define FLASH_CTRL_DIECFG1_I2C_EN_M \
                                0x01000000
#define FLASH_CTRL_DIECFG1_I2C_EN_S 24
#define FLASH_CTRL_DIECFG1_UART1_EN \
                                0x00020000  // 1: UART1 is enabled. 0: UART1 
                                            // is permanently disabled. 

#define FLASH_CTRL_DIECFG1_UART1_EN_M \
                                0x00020000
#define FLASH_CTRL_DIECFG1_UART1_EN_S 17
#define FLASH_CTRL_DIECFG1_UART0_EN \
                                0x00010000  // 1: UART0 is enabled. 0: UART0 
                                            // is permanently disabled. 

#define FLASH_CTRL_DIECFG1_UART0_EN_M \
                                0x00010000
#define FLASH_CTRL_DIECFG1_UART0_EN_S 16
#define FLASH_CTRL_DIECFG1_SSI1_EN \
                                0x00000200  // 1: SSI1 is enabled. 0: SSI1 is 
                                            // permanently disabled. 

#define FLASH_CTRL_DIECFG1_SSI1_EN_M \
                                0x00000200
#define FLASH_CTRL_DIECFG1_SSI1_EN_S 9
#define FLASH_CTRL_DIECFG1_SSI0_EN \
                                0x00000100  // 1: SSI0 is enabled. 0: SSI0 is 
                                            // permanently disabled. 

