RIOT-OS/RIOT/cpu/cc2538/include/vendor/hw_flash_ctrl.h
#define FLASH_CTRL_DIECFG1_SSI0_EN_M \
                                0x00000100
#define FLASH_CTRL_DIECFG1_SSI0_EN_S 8
#define FLASH_CTRL_DIECFG1_GPTM3_EN \
                                0x00000008  // 1: GPTM3 is enabled. 0: GPTM3 
                                            // is permanently disabled. 

#define FLASH_CTRL_DIECFG1_GPTM3_EN_M \
                                0x00000008
#define FLASH_CTRL_DIECFG1_GPTM3_EN_S 3
#define FLASH_CTRL_DIECFG1_GPTM2_EN \
                                0x00000004  // 1: GPTM2 is enabled. 0: GPTM2 
                                            // is permanently disabled. 

#define FLASH_CTRL_DIECFG1_GPTM2_EN_M \
                                0x00000004
#define FLASH_CTRL_DIECFG1_GPTM2_EN_S 2
#define FLASH_CTRL_DIECFG1_GPTM1_EN \
                                0x00000002  // 1: GPTM1 is enabled. 0: GPTM1 
                                            // is permanently disabled. 

#define FLASH_CTRL_DIECFG1_GPTM1_EN_M \
                                0x00000002
#define FLASH_CTRL_DIECFG1_GPTM1_EN_S 1
#define FLASH_CTRL_DIECFG1_GPTM0_EN \
                                0x00000001  // 1: GPTM0 is enabled. 0: GPTM0 
                                            // is permanently disabled. 

#define FLASH_CTRL_DIECFG1_GPTM0_EN_M \
                                0x00000001
#define FLASH_CTRL_DIECFG1_GPTM0_EN_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FLASH_CTRL_DIECFG2 register.
//
//*****************************************************************************
#define FLASH_CTRL_DIECFG2_DIE_MAJOR_REVISION_M \
                                0x0000F000  // Indicates the major revision 
                                            // (all layer change) number for 
                                            // the cc2538 0x0 - PG1.0 0x2 - 
                                            // PG2.0 

#define FLASH_CTRL_DIECFG2_DIE_MAJOR_REVISION_S 12
#define FLASH_CTRL_DIECFG2_DIE_MINOR_REVISION_M \
                                0x00000F00  // Indicates the minor revision 
                                            // (metla layer only) number for 
                                            // the cc2538 0x0 - PG1.0 or PG2.0 

#define FLASH_CTRL_DIECFG2_DIE_MINOR_REVISION_S 8
#define FLASH_CTRL_DIECFG2_RF_CORE_EN \
                                0x00000004  // 1: RF_CORE is enabled. 0: 
                                            // RF_CORE is permanently disabled. 

#define FLASH_CTRL_DIECFG2_RF_CORE_EN_M \
                                0x00000004
#define FLASH_CTRL_DIECFG2_RF_CORE_EN_S 2
#define FLASH_CTRL_DIECFG2_AES_EN \
                                0x00000002  // 1: AES is enabled. 0: AES is 
                                            // permanently disabled. 

#define FLASH_CTRL_DIECFG2_AES_EN_M \
                                0x00000002
#define FLASH_CTRL_DIECFG2_AES_EN_S 1
#define FLASH_CTRL_DIECFG2_PKA_EN \
                                0x00000001  // 1: PKA is enabled. 0: PKA is 
                                            // permanently disabled. 

#define FLASH_CTRL_DIECFG2_PKA_EN_M \
                                0x00000001
#define FLASH_CTRL_DIECFG2_PKA_EN_S 0


#endif // __HW_FLASH_CTRL_H__

